{"posts":[{"title":"Pharmacokinetics and Toxicity","text":"Deep-PK: A web-server for pharmacokinetics and toxicity screening, interpretation and optimization. Be aware of: The 73 pharmacokinetics and toxicity models each have their own chemical space of training molecules. Thus, the confidence for distant or unique query molecules can be low. Take a look of model’s performance and confidence levels in result page. What’s the advantages of using Deep-PK? Better performance and easier to use than other available tools","link":"/2024/04/21/pharmacokinetics/"},{"title":"Antibody Engineering","text":"CSM-AB: A web-server for accurate antibody-antigen binding affinity (KD, ∆G) predictions. Be aware of: This web-server does not do anything with “Docking” but single point energy calcualtion; thus, users should provide their query antibody-antigen complexes to get their binding affinity predictions done. Binding affinity, KD (Dissociation Constant), represents how strong the antibody or antigen binds to its partner. In this study, we simply used ∆G for “binding energy”. What’s the advantages of using CSM-AB? Better performance and easier to use than other available tools Very fast and efficiently re-rank the docked ab-ag complexes mCSM-AB2 and mmCSM-AB: Predicting the changes of antibody-antigen binding affinity (∆KD, ∆∆G) upon single point mutation (mCSM-AB2) and multiple mutations (mmCSM-AB) Be aware of: Binding affinity, KD (Dissociation Constant), represents how strong the antibody or antigen binds to its partner. In this study, we simply used ∆∆G for the changes of “binding energy” upon mutation. The negative ∆∆G represents decreasing of ab-ag binding affinity and vice versa. This is opposite to the conventional sign of ∆∆G because we calculated the labels (∆∆G) by ∆G(WT) - ∆G(MT). What’s the advantages of using mCSM-AB2 and mmCSM-AB? Better performance and easier to use than other available tools Very fast and efficiently browse hotspots or meaningful mutations via Alanine Scanning or Saturation Mutagenesis.","link":"/2024/04/21/antibody_engineering/"}],"tags":[],"categories":[{"name":"webservers","slug":"webservers","link":"/webservers/"}],"pages":[{"title":"Publications","text":"Journal Papers Al-Jarf R, Myung Y, Rodrigues CHM, Pires DEV, Ascher DB piscesCSM: prediction of anticancer synergistic drug combinations. J. Cheminform, 2024; accepted Zhou, Y, Myung, Y, Rodrigues CHM, Ascher DB. DDMut-PPI: predicting effects of mutations on protein-protein interactions using graph-based deep learning. Nucleic Acids Research, 2024; accepted Myung, Y, Sá, A. G. C. de, Ascher, DB. Deep-PK: deep learning for small molecule pharmacokinetic and toxicity prediction. Nucleic Acids Research, 2024; gkae254. Gu X, Kovacs AS, Myung Y, Ascher DB. Mutations in Glycosyltransferases and Glycosidases: Implications for Associated Diseases. Biomolecules. 2024; 14(4):497. Al-Jarf R, Karmakar M, Myung Y, Ascher DB. Uncovering the Molecular Drivers of NHEJ DNA Repair-Implicated Missense Variants and Their Functional Consequences. Genes (Basel). 2023 Sep 29;14(10):1890. doi: 10.3390/genes14101890. PMID: 37895239; PMCID: PMC10606680. Myung Y, Pires DEV, Ascher DB. Understanding the complementarity and plasticity of antibody-antigen interfaces. Bioinformatics. 2023 Jul 1;39(7):btad392. doi: 10.1093/bioinformatics/btad392. PMID: 37382557; PMCID: PMC10329492. Ruff KM, Choi YH, Cox D, Ormsby AR, Myung Y, Ascher DB, Radford SE, Pappu RV, Hatters DM*. Sequence grammar underlying the unfolding and phase separation of globular proteins. Mol Cell. 2022 Sep 1;82(17):3193-3208.e8. doi: 10.1016/j.molcel.2022.06.024. Epub 2022 Jul 18. PMID: 35853451. Tichkule S, Myung Y, Naung MT, Ansell BRE, Guy AJ, Srivastava N, Mehra S, Cacciò SM, Mueller I, Barry AE, van Oosterhout C, Pope B, Ascher DB, Jex AR*. VIVID: A Web Application for Variant Interpretation and Visualization in Multi-dimensional Analyses. Mol Biol Evol. 2022 Sep 1;39(9):msac196. doi: 10.1093/molbev/msac196. PMID: 36103257; PMCID: PMC9514033. Myung Y, Pires DEV, Ascher DB. CSM-AB: graph-based antibody-antigen binding affinity prediction and docking scoring function. Bioinformatics. 2022 Jan 27;38(4):1141-1143. doi: 10.1093/bioinformatics/btab762. PMID: 34734992. Nguyen TB, Myung Y, de Sá AGC, Pires DEV, Ascher DB. mmCSM-NA: accurately predicting effects of single and multiple mutations on protein-nucleic acid binding affinity. NAR Genom Bioinform. 2021 Nov 17;3(4):lqab109. doi: 10.1093/nargab/lqab109. PMID: 34805992; PMCID: PMC8600011. da Silva BM, Myung Y, Ascher DB, Pires DEV. epitope3D: a machine learning method for conformational B-cell epitope prediction. Brief Bioinform. 2022 Jan 17;23(1):bbab423. doi: 10.1093/bib/bbab423. PMID: 34676398. Lin H, Ascher DB, Myung Y, Lamborg CH, Hallam SJ, Gionfriddo CM, Holt KE, Moreau JW. Mercury methylation by metabolically versatile and cosmopolitan marine bacteria. ISME J. 2021 Jun;15(6):1810-1825. doi: 10.1038/s41396-020-00889-4. Epub 2021 Jan 27. PMID: 33504941; PMCID: PMC8163782. Myung Y, Pires DEV, Ascher DB. mmCSM-AB: guiding rational antibody engineering through multiple point mutations. Nucleic Acids Res. 2020 Jul 2;48(W1):W125-W131. doi: 10.1093/nar/gkaa389. PMID: 32432715; PMCID: PMC7319589. Portelli S, Olshansky M, Rodrigues CHM, D’Souza EN, Myung Y, Silk M, Alavi A, Pires DEV, Ascher DB. Exploring the structural distribution of genetic variation in SARS-CoV-2 with the COVID-3D online resource. Nat Genet. 2020 Oct;52(10):999-1001. doi: 10.1038/s41588-020-0693-3. Erratum in: Nat Genet. 2021 Feb;53(2):254. PMID: 32908256. Portelli S, Myung Y, Furnham N, Vedithi SC, Pires DEV, Ascher DB. Prediction of rifampicin resistance beyond the RRDR using structure-based machine learning approaches. Sci Rep. 2020 Oct 22;10(1):18120. doi: 10.1038/s41598-020-74648-y. PMID: 33093532; PMCID: PMC7581776. Seo M, Shin HK, Myung Y, Hwang S, No KT*. Development of Natural Compound Molecular Fingerprint (NC-MFP) with the Dictionary of Natural Products (DNP) for natural product-based drug development. J Cheminform. 2020 Jan 22;12(1):6. doi: 10.1186/s13321-020-0410-3. PMID: 33431009; PMCID: PMC6977316. Myung Y, Rodrigues CHM, Ascher DB, Pires DEV. mCSM-AB2: guiding rational antibody design using graph-based signatures. Bioinformatics. 2020 Mar 1;36(5):1453-1459. doi: 10.1093/bioinformatics/btz779. PMID: 31665262. Pires DEV, Veloso WNP, Myung Y, Rodrigues CHM, Silk M, Rezende PM, Silva F, Xavier JS, Velloso JPL, da Silveira CH, Ascher DB. EasyVS: a user-friendly web-based tool for molecule library selection and structure-based virtual screening. Bioinformatics. 2020 Aug 15;36(14):4200-4202. doi: 10.1093/bioinformatics/btaa480. PMID: 32399551. Rodrigues CHM, Myung Y, Pires DEV, Ascher DB. mCSM-PPI2: predicting the effects of mutations on protein-protein interactions. Nucleic Acids Res. 2019 Jul 2;47(W1):W338-W344. doi: 10.1093/nar/gkz383. PMID: 31114883; PMCID: PMC6602427. Myung Y, Yeom S, Han S*. A niosomal bilayer of sorbitan monostearate in complex with flavones: a molecular dynamics simulation study. J Liposome Res. 2016 Dec;26(4):336-44. doi: 10.3109/08982104.2016.1144204. Epub 2016 Mar 16. PMID: 26982006. Myung Y, &amp; Han S*. (2010). Force Field Parameters for 3-Nitrotyrosine and 6-Nitrotryptophan. Bulletin of the Korean Chemical Society, 31(9), 2581–2587. Book Chapters David B Ascher, Lisa M Kaminskas, Yoochan Myung, Douglas EV Pires. (2023). “Using Graph-Based Signatures to Guide Rational Antibody Engineering”. in Computer-Aided Antibody Design. (pp. 375-397). Humana, New York, NY Edward Airey, Stephanie Portelli, Joicymara S. Xavier, Yoochan Myung, Michael Silk, Malancha Karmakar, João P. L. Velloso, Carlos H. M. Rodrigues, Hardik H. Parate, Raghad Al-Jarf, Lucy Barr, Juliana A. Geraldo, Pâmela M. Rezende, Douglas E. V. Pires, David B. Ascher. (2020). “Identifying genotype-phenotype correlations via integrative mutation analysis.” in Methods Mol Biol Springer Netherlands Pires, D.E.V., Portelli, S., Rezende, P.M., Veloso, W.N.P., Xavier, J.S., Velloso, J.P.L., Karmakar, M.,Yoochan Myung, Rodrigues, C.H.M., Silk, M. and Ascher, D.B. (2020). “A comprehensive computational platform to guide drug development using graph-based signature methods.” Methods in Molecular Biology. (pp. 91-106) Pires, D. E. V., Rodrigues, C. H. M., Albanaz, A. T. S., Karmakar, M.,Yoochan Myung, Xavier, J., Michanetzi, E., Portelli, S., Ascher, D.B. (2019). “Exploring Protein Supersecondary Structure Through Changes in Protein Folding, Stability, and Flexibility.” In A. E. Kister (Ed.), Protein Supersecondary Structures: Methods and Protocols (pp. 173-185). New York, NY: Springer New York Oral and Poster Presentations Oral Presentation, “Leveraging AI for Enhanced Drug Discovery: Perspectives on Antibody Engineering and Small Molecule Pharmacokinetics”, SBB theme seminar (27th March, 2024) Oral Presentation, “Rational antibody affinity maturation using graph-based signatures”, ABACBS 2023 (6th Dec, 2023) Poser Presentation, “Deep-pk: in silico Pharmacokinetic Property Prediction and Optimisation using Graph Neural Networks”, ABACBS 2023 (6th Dec, 2023) Oral Presentation, “Deep-pk: in silico Pharmacokinetic Property Prediction and Optimisation using Graph Neural Networks”, INCOB 2023 (14th Nov, 2023) Oral Presentation, “Rational antibody affinity maturation using graph-based signatures”, INCOB 2023 (14th Nov, 2023) Oral Presentation, “Rational protein engineering”, the Australian Centre for Ecogenomics (5th Oct, 2023) Poster Presentation, 47th Lorne Proteins Conference (2022) Oral Presentation, PhD Oration (2021) Oral Presentation, MDHS Graduate Researcher Conference (2020) Poster Presentation, 45th Lorne Protein Conference (2020) Oral Presentation, Graduate Researcher Data Club (2019) Oral Presentation, BAMBII Annual Graduate Student Retreat (2019) Oral Presentation, 3-minute Thesis Competition (2019) Poster Presentation, 44th Lorne Protein Conference (2019) Oral Presentation, BAMBII Annual Graduate Student Retreat (2018) Poster Presentation, 17th Melbourne Protein Group Student Symposium (2018) Poster Presentation, Lorne Protein Engineering Conference (2018) Patents Cosmetic Composition with Bamboo Leaf Ethanol Extract and Bamboo Oil, Application No. 10-2012-0105344, Korea (2012) Cosmetic Composition for Skin-irritation Alleviation with lnula britannica var. chinensis, Cynanchi Radix and Lysimachiafoenumgraecum Hance, Application No. 10-2012-0087579, Korea (2012) Cosmetic Composition with Anti-UV and Anti-wrinkle Effect from Caragana sinica Rehder, Application No. 10-2012-0068312, Korea (2012)","link":"/publications/"},{"title":"projects","text":"","link":"/projects/"},{"title":"webservers","text":"Deep-PK adfasdf","link":"/webservers/"},{"title":"cv","text":"Work Experience The University of Queensland, St Lucia, QLD, Australia (2022-present)Postdoctoral Research Fellow Developing deep learning-based approaches for antibody engineering and pharmacokinetics, with David Ascher Baker Institute, Melbourne, VIC, Australia (2019-present)Graduate/Honorary Researcher Developed machine learning models to elucidate genotype-phenotype associations in metabolic diseases, with Brian Drew Developing machine learning models for enhanced accuracy in blood pressure measurement, with Dean Picone and James Sharman RMIT University, Bundoora, VIC, Australia (2021-2022)Assistant Researcher Conducted a mutational analysis of human telomerase proteins using molecular dynamics simulation, with Jessica Holien Bioinformatics and Molecular Design Research Centre, Seoul, Rep. of Korea (2017)Senior Researcher Developed a noise-reduction screening system for high-resolution mass spectrometry Insilico Inc., Gyeonggi-do, Rep. of Korea (2013-2015)Assistant Researcher / Sales Representative Managed sales and technical supports for the drug discovery platform, Discovery Studio (Biovia) Radiant Inc., Gangwon-do, Rep. of Korea (2010-2013)Assistant Researcher Designed and conducted research projects focused on utilising natural products in cosmetics and household materials Korea Basic Science Institute, Gangwon-do, Rep. of Korea (2008)Undergraduate Researcher Conducted live cell imaging studies using confocal microscopy, under the supervision of Seung-Hae Kwon Kangwon National University, Gangwon-do, Rep. of Korea (2007-2011)Graduate/Undergraduate Researcher Conducted in vitro anti-cancer efficacy studies of peptide nucleic acids (PNAs), with OliPass Inc., Education The University of Melbourne, Parkville, Melbourne, Australia (2022)PhD, Department of Biochemistry and PharmacologyThesis: ”Developing a computational platform for better antibody engineering and vaccine designs”, supervised by David B Ascher Kangwon National University, Gangwon-do, Rep. of Korea (2011)MSc, Department of BiochemistryThesis: ”Molecular Mechanics Simulations of Protein Containing Nitrated Tyrosine and Tryptophan Residues”, supervised by Sang-Wha HanGPA: 4.5/4.5 Kangwon National University, Gangwon-do, Rep. of Korea (2009)BSc, Department of BiochemistryGPA: 3.94/4.5 Honours/Awards Young Science Program (2024), KSBMB 2024 Sawyer Medal Prize (2021), Department of Biochemistry and Pharmacology, The University of Melbourne Graduate Student Travel Award (2020-2021), Department of Biochemistry and Pharmacology, The University of Melbourne Student Poster Prize (2019), 44th Lorne Protein Conference Melbourne Research Scholarship (2017-2022), The University of Melbourne Thesis Poster Award (2009), Kangwon National University Honours Scholarship (2007-2011), Kangwon National University","link":"/cv/"},{"title":"Who am I","text":"I’m a Bioinformatician, Biochemist, and computer enthusiast with a passion for unraveling biological mysteries through computational methods. Throughout my Bachelor’s Degree, my focus was on conducting in vitro experiments predominantly rooted in molecular biology. I delved into tasks like screening anti-cancer or anti-inflammatory molecules across various cell lines using techniques such as Western blotting. Working within the dynamic environment of the “Free Radical” laboratory, I had the opportunity to broaden my skill set, engaging in biophysical experiments and utilizing diverse instruments like UV/VIS spectrometers and Rahman microscopy. In the realm of cell-related assays like Western blotting, achieving reproducibility is paramount yet often challenging. It’s not merely about mastering techniques; numerous unknown variables can affect outcomes. A memorable insight came from a colleague likening it to the uniqueness of bodily functions despite identical diets—an analogy that underscored the complexity of the task. My epiphany came during a Biophysical Chemistry class when Professor Han introduced Molecular Docking and Molecular Dynamics Simulations. Unlike experimental work, these computational methods offered a promise of perfect reproducibility. That pivotal moment cemented my decision to chart a path in Computational Biology. Furthermore, since I was young, I’ve had a pure enjoyment for fixing, modifying, and building computers. This passion positioned me perfectly to delve into Computational Biology. As evident from my CV, I’ve explored a diverse array of projects, extending beyond the conventional scope. These include: Screening anti-malodor materials from natural compounds: Utilizing “Gas Cylinder” detectors to measure malodor agents. Investigating methods to reduce the toxicity and pungency of pharmaceutical and coloring agents. Conducting assessments of physical properties such as melting point and evaluating the anti-cancer efficacy of PNAs. Employing Molecular Docking simulations to discern the differential interactions among major anti-neuraminidase inhibitors.","link":"/whoami/"},{"title":"Who am I","text":"I’m a Bioinformatician, Biochemist, and computer enthusiast with a passion for unraveling biological mysteries through computational methods. Throughout my Bachelor’s Degree, my focus was on conducting in vitro experiments predominantly rooted in molecular biology. I delved into tasks like screening anti-cancer or anti-inflammatory molecules across various cell lines using techniques such as Western blotting. Working within the dynamic environment of the “Free Radical” laboratory, I had the opportunity to broaden my skill set, engaging in biophysical experiments and utilizing diverse instruments like UV/VIS spectrometers and Rahman microscopy. In the realm of cell-related assays like Western blotting, achieving reproducibility is paramount yet often challenging. It’s not merely about mastering techniques; numerous unknown variables can affect outcomes. A memorable insight came from a colleague likening it to the uniqueness of bodily functions despite identical diets—an analogy that underscored the complexity of the task. My epiphany came during a Biophysical Chemistry class when Professor Han introduced Molecular Docking and Molecular Dynamics Simulations. Unlike experimental work, these computational methods offered a promise of perfect reproducibility. That pivotal moment cemented my decision to chart a path in Computational Biology. Furthermore, since I was young, I’ve had a pure enjoyment for fixing, modifying, and building computers. This passion positioned me perfectly to delve into Computational Biology. As evident from my CV, I’ve explored a diverse array of projects, extending beyond the conventional scope. These include: Screening anti-malodor materials from natural compounds: Utilizing “Gas Cylinder” detectors to measure malodor agents. Investigating methods to reduce the toxicity and pungency of pharmaceutical and coloring agents. Conducting assessments of physical properties such as melting point and evaluating the anti-cancer efficacy of PNAs. Employing Molecular Docking simulations to discern the differential interactions among major anti-neuraminidase inhibitors.","link":"/"}]}